vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
typedef struct {
    move_queue_add_req_t req;
} motion_queue_entry_t;

enum { AXIS_X = 0, AXIS_Y = 1, AXIS_Z = 2 };
enum { MOTION_ACK_OK = 0, MOTION_ACK_INVALID = 1, MOTION_ACK_QUEUE_FULL = 2 };

/* =======================
 *  Estado global
 * ======================= */
static motion_status_t g_status;
static motion_axis_state_t g_axis_state[MOTION_AXIS_COUNT];
static volatile uint8_t g_has_active_segment = 0u;

static motion_queue_entry_t g_queue[MOTION_QUEUE_CAPACITY];
static uint8_t  g_queue_head  = 0u;
static uint8_t  g_queue_tail  = 0u;
static uint16_t g_queue_count = 0u;  /* suporta até 256 entradas */
static uint8_t g_active_frame_id = 0u; 

/* Soma dos passos restantes na FILA (exclui segmento ativo) por eixo.
 * Mantida em O(1) nos push/pop para permitir consultas rápidas no TIM6. */
static uint32_t g_queue_rem_steps[MOTION_AXIS_COUNT];

static int64_t  g_encoder_position[MOTION_AXIS_COUNT];
static uint32_t g_encoder_last_raw[MOTION_AXIS_COUNT];
static int64_t  g_encoder_origin[MOTION_AXIS_COUNT];
static int32_t  g_encoder_delta_tick[MOTION_AXIS_COUNT]; /* delta de contagens por tick TIM7 */
static int32_t  g_origin_base32[MOTION_AXIS_COUNT]; /* offset externo (origin-set) */

/* PI de velocidade baseado no encoder
 * Notas:
 *  - Ganhos kp/ki/kd recebidos via protocolo são inteiros de 16 bits.
 *  - A saída da correção é escalada por 2^-8 (>> 8) para manter estabilidade.
 */
#define MOTION_PI_SHIFT              8
#define MOTION_PI_I_CLAMP            (200000)
#define MOTION_PI_CORR_MAX_SPS       (MOTION_MAX_SPS)
// Controle PI desativado por padrão (somente telemetria)
//#ifndef MOTION_PI_ENABLE
#define MOTION_PI_ENABLE 1
//#endif

/* =======================
 *  Calibração simples (sem floats)
 * ======================= */
/*
 * Passo do motor: 0,9° => 400 passos/rotação (STEPS_PER_REV_BASE)
 * Ajuste MICROSTEP_FACTOR se o TMC estiver configurado com microstepping
 * (ex.: 16 => 6400 passos/rotação no DDA).
 */
//#ifndef MICROSTEP_FACTOR
#define MICROSTEP_FACTOR 256
//#endif
#define STEPS_PER_REV_BASE   400u
#define DDA_STEPS_PER_REV    (STEPS_PER_REV_BASE * MICROSTEP_FACTOR)
/* Encoders por rotação (fornecido): X/Z = 40000, Y = 5000 */
static const uint32_t ENC_COUNTS_PER_REV[3] = { 40000u, 5000u, 40000u}; // X,Y,Z 
static volatile uint16_t g_microstep_factor = MICROSTEP_FACTOR;
static inline uint32_t dda_steps_per_rev(void) { return STEPS_PER_REV_BASE * (uint32_t)g_microstep_factor; }

/* Deadband em passos para o PI de posição (evita tremor próximo de zero) */
#ifndef MOTION_PI_DEADBAND_STEPS
#define MOTION_PI_DEADBAND_STEPS 10
#endif

/* Derivada filtrada (para reduzir ruído do encoder no D-term) */
static int32_t g_pi_d_filt[MOTION_AXIS_COUNT];
/* Acumulador de aceleração (converter a_sps2/1000 com maior precisão) */
static uint32_t g_v_accum[MOTION_AXIS_COUNT];
static int32_t g_pi_i_accum[MOTION_AXIS_COUNT];
static int32_t g_pi_prev_err[MOTION_AXIS_COUNT];
// Sombras 32-bit para uso com SWV Data Trace/Graph
volatile int32_t g_enc_abs32[MOTION_AXIS_COUNT];
volatile int32_t g_enc_rel32[MOTION_AXIS_COUNT];

// Telemetria CSV: tempo(ms) desde início da variação do encoder,
// posição relativa do encoder e total de passos emitidos desde o início
static volatile uint8_t  g_csv_active[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_t0_ms[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_stepcount[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_next_ms[MOTION_AXIS_COUNT];
static volatile uint8_t  g_csv_armed[MOTION_AXIS_COUNT]; // 1=armado no start_move; ativa ao primeiro STEP

// Referência de tempo baseada em ticks do TIM6 (mais estável que SysTick em prints SWO)
static volatile uint32_t g_csv_t0_t6[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_next_t6[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_seq[MOTION_AXIS_COUNT]; /* id incremental por eixo */

#if MOTION_CSV_PRODUCE_IN_TIM6
typedef struct {
    uint32_t id;      /* id incremental */
    uint32_t t6;      /* tempo relativo em ticks do TIM6 */
    int32_t  rel;     /* encoder relativo */
    uint32_t steps;   /* total de steps emitidos */
} motion_csv_sample_t;

static volatile motion_csv_sample_t g_csv_ring[MOTION_AXIS_COUNT][MOTION_CSV_RING_CAP];
static volatile uint16_t g_csv_rhead[MOTION_AXIS_COUNT];
static volatile uint16_t g_csv_rtail[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_next_prod_t6; /* agenda global: a cada 50 ticks (1ms) */

static inline void csv_ring_reset(void)
{
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
        g_csv_rhead[a] = 0u;
        g_csv_rtail[a] = 0u;
    }
    g_csv_next_prod_t6 = 0u;
}

static inline void csv_ring_push(uint8_t axis, uint32_t id, uint32_t t6, int32_t rel, uint32_t steps)
{
    uint16_t h = g_csv_rhead[axis];
    uint16_t n = (uint16_t)((h + 1u) % MOTION_CSV_RING_CAP);
    if (n == g_csv_rtail[axis]) {
        /* ring cheio: descarta o mais antigo (avança tail) para não bloquear produtor */
        g_csv_rtail[axis] = (uint16_t)((g_csv_rtail[axis] + 1u) % MOTION_CSV_RING_CAP);
    }
    g_csv_ring[axis][h].id    = id;
    g_csv_ring[axis][h].t6    = t6;
    g_csv_ring[axis][h].rel   = rel;
    g_csv_ring[axis][h].steps = steps;
    g_csv_rhead[axis] = n;
}

static inline int csv_ring_pop(uint8_t axis, motion_csv_sample_t *out)
{
    uint16_t t = g_csv_rtail[axis];
    if (t == g_csv_rhead[axis]) return 0;
    if (out) {
        * (motion_csv_sample_t*)out = g_csv_ring[axis][t];
    }
    g_csv_rtail[axis] = (uint16_t)((t + 1u) % MOTION_CSV_RING_CAP);
    return 1;
}
#endif /* MOTION_CSV_PRODUCE_IN_TIM6 */

// Forward declarations for lock helpers used below
static inline uint32_t motion_lock(void);
static inline void     motion_unlock(uint32_t primask);

// Checagem local de habilitação do SWO/ITM (porta 0)
static inline int motion_swo_enabled(void)
{
    return ((CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk) &&
            (DBGMCU->CR & DBGMCU_CR_TRACE_IOEN) &&
            (ITM->TCR & ITM_TCR_ITMENA_Msk) &&
            (ITM->TER & (1UL << 0)));
}

