vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
static inline void motion_csv_print(uint8_t axis, uint32_t id, uint32_t t_val, int32_t rel, uint32_t steps)
{
#if MOTION_CSV_BIN_ITM
    // Frame binário compacto: [tag(1) axis(1) id(4) t(4) rel(4) steps(4)]
    // tag='E' (0x45) para encoder; axis=0..2
    if (motion_swo_enabled()) {
        ITM_SendChar('E');
        ITM_SendChar((uint32_t)axis);
        uint32_t v;
        v = id;      for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = t_val;   for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = (uint32_t)rel; for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = steps;   for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        ITM_SendChar('\n');
        return;
    }
#endif

#if MOTION_CSV_TEXT_ENABLE
#if MOTION_CSV_INCLUDE_ID
    // Texto: axis,id,time,rel,steps (rel como int32 para evitar wrap sem sinal)
    printf("%u,%lu,%lu,%d,%lu\r\n",
           (unsigned)axis,
           (unsigned long)id,
           (unsigned long)t_val,
           (int)rel,
           (unsigned long)steps);
#else
    // Compatibilidade: axis,time,rel,steps
    printf("%u,%lu,%d,%lu\r\n",
           (unsigned)axis,
           (unsigned long)t_val,
           (int)rel,
           (unsigned long)steps);
#endif
#endif /* MOTION_CSV_TEXT_ENABLE */
}

static uint32_t g_step_print_count[MOTION_AXIS_COUNT] = {0,0,0};

static volatile uint8_t g_demo_continuous = 0u; /* 1 = gera passos continuamente (modo DEMO) */
static const uint16_t  g_demo_speed_table[4] = { 5u, 10u, 20u, 40u }; /* ksteps/s aprox (TIM7 ~1kHz) */
static volatile uint8_t g_demo_speed_idx = 1u;

/* =======================
 *  Helpers de lock
 * ======================= */
static inline uint32_t motion_lock(void) {
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    return primask;
}
static inline void motion_unlock(uint32_t primask) {
    __set_PRIMASK(primask);
}

/* Forward decl. para função usada pela seleção de mestre (progress) */
static uint32_t motion_remaining_steps_total_for_axis(uint8_t axis);

/* =======================
 *  Seleção de Mestre (modo progress)
 * ======================= */
#if MOTION_PROGRESS_MODE
static inline int8_t motion_select_master_axis_progress(void)
{
    int8_t master = -1;
    uint32_t m_num = 0u, m_den = 1u;

    /* 1) Preferir o menor progresso ENTRE eixos que ainda têm trabalho (ativo+fila)
          e que participam do segmento atual (total_steps>0). */
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        /* total restante (ativo + fila) em O(1) */
        const motion_axis_state_t *ax = &g_axis_state[axis];
        uint32_t active = (ax->total_steps > ax->emitted_steps)
                          ? (ax->total_steps - ax->emitted_steps) : 0u;
        uint32_t rem_total = active + g_queue_rem_steps[axis];
        if (rem_total == 0u) continue; /* não escolher quem já acabou de vez */
        if (ax->total_steps == 0u) continue; /* não participa do segmento atual */

        uint32_t num = ax->emitted_steps; /* progresso acumulado */
        uint32_t den = ax->total_steps;   /* tamanho do segmento */
        if (master < 0) { master = (int8_t)axis; m_num = num; m_den = den; }
        else if ((uint64_t)num * (uint64_t)m_den < (uint64_t)m_num * (uint64_t)den) {
            master = (int8_t)axis; m_num = num; m_den = den;
        }
    }

    /* 2) Fallback: se ninguém do segmento atual tem rem_total>0, escolha
          o eixo com MAIOR rem_total geral (apontando para o próximo da fila). */
    if (master < 0) {
        uint32_t best_rem = 0u;
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            const motion_axis_state_t *ax = &g_axis_state[axis];
            uint32_t active = (ax->total_steps > ax->emitted_steps)
                              ? (ax->total_steps - ax->emitted_steps) : 0u;
            uint32_t rem_total = active + g_queue_rem_steps[axis];
            if (rem_total > best_rem) { best_rem = rem_total; master = (int8_t)axis; }
        }
    }

    return master;
}
#endif /* MOTION_PROGRESS_MODE */
/* =======================
 *  Helpers de acesso por eixo
 * ======================= */
static inline uint32_t motion_total_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->sx;
        case AXIS_Y: return req->sy;
        case AXIS_Z:
        default:     return req->sz;
    }
}

static inline uint16_t motion_velocity_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->vx;
        case AXIS_Y: return req->vy;
        case AXIS_Z:
        default:     return req->vz;
    }
}

static inline uint16_t motion_kp_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->kp_x;
        case AXIS_Y: return req->kp_y;
        case AXIS_Z:
        default:     return req->kp_z;
    }
}

static inline uint16_t motion_ki_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->ki_x;
        case AXIS_Y: return req->ki_y;
        case AXIS_Z:
        default:     return req->ki_z;
    }
}

static inline uint16_t motion_kd_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->kd_x;
        case AXIS_Y: return req->kd_y;
        case AXIS_Z:
        default:     return req->kd_z;
    }
}

static inline int8_t motion_clamp_error(int32_t value) {
    if (value > 127)  return 127;
    if (value < -128) return -128;
    return (int8_t)value;
}

/* Soma restante (em passos) no eixo, incluindo segmento ativo + fila
 * Usado para decidir desaceleração suave no final da lista de movimentos. */
static uint32_t motion_remaining_steps_total_for_axis(uint8_t axis)
{
    uint32_t rem = 0u;
    if (axis < MOTION_AXIS_COUNT) {
        const motion_axis_state_t *ax = &g_axis_state[axis];
        if (ax->total_steps > ax->emitted_steps)
            rem += (ax->total_steps - ax->emitted_steps);
    }
    for (uint16_t i = 0; i < g_queue_count; ++i) {
        uint8_t idxq = (uint8_t)(((uint16_t)g_queue_head + i) % MOTION_QUEUE_CAPACITY);
        const move_queue_add_req_t *q = &g_queue[idxq].req;
        rem += motion_total_for_axis(q, axis);
    }
    return rem;
}

/* =======================
 *  Status e fila
 * ======================= */
static void motion_refresh_status_locked(void) {
    /* depth reportado cabe em 8 bits; faz clamp para 255 */
    uint32_t depth32 = (uint32_t)g_queue_count + (uint32_t)(g_has_active_segment ? 1u : 0u);
    if (depth32 > 255u) depth32 = 255u;
    g_status.queue_depth = (uint8_t)depth32;

    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        const motion_axis_state_t *ax = &g_axis_state[axis];
        uint32_t total = ax->total_steps;
        uint32_t emitted = ax->emitted_steps;
        uint8_t pct = 0u;

        if (g_has_active_segment && total > 0u) {
            uint64_t scaled = (uint64_t)emitted * 100u;
            pct = (uint8_t)(scaled / total);
            if (pct > 100u) pct = 100u;
        } else if (total == 0u && g_has_active_segment) {
            pct = 100u;
        } else if (!g_has_active_segment && total > 0u) {
            pct = (emitted >= total) ? 100u : (uint8_t)(((uint64_t)emitted * 100u) / total);
        }

        /* Erro em UNIDADES DE PASSOS (alinhado ao PI de posição)
         * desired_steps = passos emitidos no segmento (target_steps)
         * actual_steps  = encoder_rel convertido para passos DDA
         */
        int64_t enc_rel = g_encoder_position[axis] - g_encoder_origin[axis];
        if (enc_rel > (int64_t)INT32_MAX) enc_rel = INT32_MAX;
        else if (enc_rel < (int64_t)INT32_MIN) enc_rel = INT32_MIN;
        int64_t num = enc_rel * (int64_t)dda_steps_per_rev();
        int32_t actual_steps = (ENC_COUNTS_PER_REV[axis]
                                ? (int32_t)(num / (int64_t)ENC_COUNTS_PER_REV[axis])
                                : 0);
        int32_t desired_steps = (int32_t)ax->target_steps;
        int32_t err = desired_steps - actual_steps;
        int8_t  err8 = motion_clamp_error(err);

        switch (axis) {
            case AXIS_X: g_status.pctX = pct; g_status.pidErrX = err8; break;
            case AXIS_Y: g_status.pctY = pct; g_status.pidErrY = err8; break;
            case AXIS_Z:
            default:     g_status.pctZ = pct; g_status.pidErrZ = err8; break;
        }
    }
}


