vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
            /* Distância necessária para frear de v para 0: s = v^2 / (2a) */
            uint32_t v_now = ax->v_actual_sps;
            uint32_t s_brake = 0u;
            if (a_sps2 > 0u && v_now > 0u) {
                uint64_t vv = (uint64_t)v_now * (uint64_t)v_now;
                uint64_t denom = (uint64_t)(2u * a_sps2);
                s_brake = (uint32_t)(vv / denom);
            }

            /* Política de rampa:
             * - Se já estamos perto do final (rem_steps <= s_brake): desacelera.
             * - Caso contrário, acelera até v_cmd_sps; se passou, reduz até v_cmd_sps. */
            /* Aceleração integrada: usa g_v_accum para passos discretos de v */
            g_v_accum[axis] += a_sps2; /* steps/s^2 * 1ms */
            uint32_t steps_avail = 0u;
            while (g_v_accum[axis] >= 1000u) { g_v_accum[axis] -= 1000u; steps_avail++; }
            while (steps_avail--) {
                if (rem_steps <= s_brake) {
                    /* Desacelera */
                    if (ax->v_actual_sps > 0u) ax->v_actual_sps--;
                } else if (ax->v_actual_sps < v_cmd_sps) {
                    ax->v_actual_sps++;
                    if (ax->v_actual_sps > v_cmd_sps) ax->v_actual_sps = v_cmd_sps;
                } else if (ax->v_actual_sps > v_cmd_sps) {
                    if (ax->v_actual_sps > 0u) ax->v_actual_sps--;
                    if (ax->v_actual_sps < v_cmd_sps) ax->v_actual_sps = v_cmd_sps;
                }
            }

            /* Se não há mais nada a emitir neste eixo, força zero */
            if (rem_steps == 0u) ax->v_actual_sps = 0u;
            if (v_cmd_sps > MOTION_MAX_SPS) v_cmd_sps = MOTION_MAX_SPS;
            if (ax->v_actual_sps > MOTION_MAX_SPS) ax->v_actual_sps = MOTION_MAX_SPS;

            /* Incremento do DDA a 50 kHz */
            ax->dda_inc_q16 = Q16_DIV_UINT(ax->v_actual_sps, MOTION_TIM6_HZ);
        }
    }

}

/* =======================
 *  Handlers de protocolo
 * ======================= */
void motion_on_move_queue_add(const uint8_t *frame, uint32_t len) {

    move_queue_add_req_t req;
    uint8_t ack_status = MOTION_ACK_INVALID;
    uint8_t frame_id = 0u;

    if (!frame) return;
    proto_result_t decode_status = move_queue_add_req_decoder(frame, len, &req);
    if (decode_status != PROTO_OK) {
        motion_send_queue_add_ack(frame_id, ack_status);
        LOGA_THIS(LOG_STATE_ERROR, decode_status, "queue_add", "decode_fail");
        return;
    }
    frame_id = req.frameId;

    if (!safety_is_safe()) {
        motion_send_queue_add_ack(frame_id, ack_status);
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "queue_add", "blocked_safety");
        return;
    }

    uint32_t primask = motion_lock();
    proto_result_t push_status = motion_queue_push_locked(&req);
    if (push_status == PROTO_OK) {
        ack_status = MOTION_ACK_OK;
        if (g_status.state == MOTION_IDLE || g_status.state == MOTION_DONE)
            g_status.state = MOTION_QUEUED;
        motion_refresh_status_locked();
#if MOTION_DEBUG_FLOW
        printf("[FLOW queue_add ok id=%u dir=0x%02X V=(%u,%u,%u) S=(%lu,%lu,%lu) depth=%u]\r\n",
               (unsigned)frame_id,
               (unsigned)req.dirMask,
               (unsigned)req.vx, (unsigned)req.vy, (unsigned)req.vz,
               (unsigned long)req.sx, (unsigned long)req.sy, (unsigned long)req.sz,
               (unsigned)g_status.queue_depth);
#endif
    } else {
        ack_status = MOTION_ACK_QUEUE_FULL;
    }
    motion_unlock(primask);

    motion_send_queue_add_ack(frame_id, ack_status);
    LOGA_THIS(LOG_STATE_RECEIVED, ack_status, "queue_add",
              "frame=%u dirMask=0x%02X queue=%u",
              (unsigned)frame_id, (unsigned)req.dirMask, (unsigned)g_status.queue_depth);
}

void motion_on_move_queue_status(const uint8_t *frame, uint32_t len) {
    move_queue_status_req_t req;
    if (move_queue_status_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "queue_status", "decode_fail");
        return;
    }
    uint32_t primask = motion_lock();
    motion_refresh_status_locked();
    motion_unlock(primask);

    motion_send_queue_status_response(req.frameId);
    LOGA_THIS(LOG_STATE_RECEIVED, PROTO_OK, "queue_status",
              "state=%u depth=%u pct=(%u,%u,%u)",
              (unsigned)g_status.state, (unsigned)g_status.queue_depth,
              (unsigned)g_status.pctX, (unsigned)g_status.pctY, (unsigned)g_status.pctZ);
}

void motion_on_start_move(const uint8_t *frame, uint32_t len) {
    start_move_req_t req;
    if (start_move_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "start_move", "decode_fail");
        return;
    }
    uint8_t started = 0u;
    uint32_t primask = motion_lock();

#if MOTION_DEBUG_FLOW
    {
        uint16_t depth = (uint16_t)(g_queue_count + (g_has_active_segment ? 1u : 0u));
        printf("[FLOW start_move request depth=%u active=%u ids=(",
               (unsigned)((depth > 255u) ? 255u : depth), (unsigned)g_active_frame_id);
        for (uint16_t i = 0; i < g_queue_count; ++i) {
            uint8_t idxq = (uint8_t)(((uint16_t)g_queue_head + i) % MOTION_QUEUE_CAPACITY);
            unsigned id = (unsigned)g_queue[idxq].req.frameId;
            printf(i ? ",%u" : "%u", id);
        }
        printf(") ]\r\n");
    }
#endif

    if (!safety_is_safe()) {
        started = 0u;
    } else if (!g_has_active_segment) {
        if (motion_try_start_next_locked()) {
            g_status.state = MOTION_RUNNING;
            started = 1u;
        }
    } else {
        g_status.state = MOTION_RUNNING;
        started = 1u;
    }

    motion_refresh_status_locked();
    motion_unlock(primask);

    (void)HAL_TIM_Base_Start_IT(&htim6);
    (void)HAL_TIM_Base_Start_IT(&htim7);

    // Arma sessões CSV para iniciarem no primeiro STEP; zera contadores
    if (started) {
        uint32_t pm = motion_lock();
        for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
            g_csv_armed[a] = 1u;             // iniciar ao primeiro STEP
            g_csv_active[a] = 0u;            // ainda não iniciou
            g_csv_t0_ms[a]  = 0u;
            g_csv_stepcount[a] = 0u;         // zera contador de passos
            g_csv_next_ms[a] = 0u;           // será setado no primeiro STEP
            g_csv_t0_t6[a] = 0u;
            g_csv_next_t6[a] = 0u;
            g_csv_seq[a] = 0u;               // reinicia id incremental por start_move
        }
        motion_unlock(pm);
#if MOTION_CSV_PRODUCE_IN_TIM6
        csv_ring_reset();
        /* agenda primeira produção 1ms à frente do tempo atual */
        g_csv_next_prod_t6 = g_tim6_ticks + (uint32_t)T6_TICKS_PER_MS;
#endif
    }

